name: "peopleNet"
platform: "tensorrt_plan"
max_batch_size: 1
default_model_filename: "resnet34_peoplenet_int8.etlt_b1_gpu0_int8.engine"
input [
  {
    name: "input_1"
    data_type: TYPE_FP32
    dims: [ 3, 544, 960 ]
  }
]
output [
  {
    name: "output_bbox/BiasAdd"
    data_type: TYPE_FP32
    dims: [ 12, 34, 60 ]
  },
  {
    name: "output_cov/Sigmoid"
    data_type: TYPE_FP32
    dims: [ 3, 34, 60 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: 0
  }
]
